run/fullScaleBase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontField
    {
        type            patch;
        nFaces          43;
        startFace       25457;
    }
    backField
    {
        type            patch;
        nFaces          43;
        startFace       25500;
    }
    symPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12900;
        startFace       25543;
    }
    sideField
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12900;
        startFace       38443;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       51343;
    }
    top
    {
        type            patch;
        nFaces          300;
        startFace       51643;
    }
)

// ************************************************************************* //
